{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "a": 4,
      "b": 5,
      "c": 6,
      "d": 7,
      "e": 8,
      "f": 9,
      "g": 10,
      "h": 11,
      "i": 12,
      "j": 13,
      "k": 14,
      "l": 15,
      "m": 16,
      "n": 17,
      "o": 18,
      "p": 19,
      "r": 20,
      "s": 21,
      "t": 22,
      "u": 23,
      "v": 24,
      "w": 25,
      "y": 26,
      "z": 27,
      "Ċ": 28,
      "č": 29,
      "Ġ": 30,
      "he": 31,
      "Ġt": 32,
      "čĊ": 33,
      "in": 34,
      "Ġthe": 35,
      "Ġs": 36,
      "Ġc": 37,
      "Ġa": 38,
      "Ġw": 39,
      "or": 40,
      "Ġr": 41,
      "ing": 42,
      "ou": 43,
      "Ġf": 44,
      "er": 45,
      "Ġb": 46,
      "ain": 47,
      "Ġrain": 48,
      "ds": 49,
      "Ġcl": 50,
      "ll": 51,
      "ar": 52,
      "Ġd": 53,
      "ow": 54,
      "on": 55,
      "es": 56,
      "Ġst": 57,
      "Ġclou": 58,
      "gh": 59,
      "Ġm": 60,
      "orm": 61,
      "Ġbr": 62,
      "Ġclouds": 63,
      "un": 64,
      "Ġco": 65,
      "igh": 66,
      "ter": 67,
      "Ġn": 68,
      "Ġsun": 69,
      "Ġstorm": 70,
      "ay": 71,
      "ee": 72,
      "is": 73,
      "Ġg": 74,
      "Ġwin": 75,
      "Ġbring": 76,
      "ight": 77,
      "av": 78,
      "ning": 79,
      "re": 80,
      "Ġhe": 81,
      "Ġsk": 82,
      "avy": 83,
      "Ġheavy": 84,
      "fter": 85,
      "Ġafter": 86,
      "Ġwind": 87,
      "at": 88,
      "all": 89,
      "et": 90,
      "nd": 91,
      "Ġl": 92,
      "Ġis": 93,
      "Ġfr": 94,
      "rou": 95,
      "um": 96,
      "ers": 97,
      "Ġdr": 98,
      "Ġsky": 99,
      "an": 100,
      "ear": 101,
      "Ġon": 102,
      "ak": 103,
      "as": 104,
      "ck": 105,
      "om": 106,
      "oon": 107,
      "her": 108,
      "Ġth": 109,
      "ore": 110,
      "orning": 111,
      "Ġfo": 112,
      "Ġclear": 113,
      "Ġmorning": 114,
      "ather": 115,
      "bre": 116,
      "ld": 117,
      "oo": 118,
      "op": 119,
      "Ġh": 120,
      "Ġp": 121,
      "Ġin": 122,
      "Ġum": 123,
      "Ġwar": 124,
      "Ġfall": 125,
      "Ġbe": 126,
      "lla": 127,
      "Ġday": 128,
      "ows": 129,
      "Ġme": 130,
      "Ġcold": 131,
      "Ġno": 132,
      "eeds": 133,
      "Ġgrou": 134,
      "Ġlight": 135,
      "brella": 136,
      "Ġumbrella": 137,
      "Ġwarm": 138,
      "Ġground": 139,
      "day": 140,
      "en": 141,
      "ev": 142,
      "eather": 143,
      "fore": 144,
      "hin": 145,
      "ies": 146,
      "le": 147,
      "now": 148,
      "noon": 149,
      "oday": 150,
      "Ġev": 151,
      "hen": 152,
      "Ġtoday": 153,
      "Ġsnow": 154,
      "Ġand": 155,
      "Ġwet": 156,
      "Ġweather": 157,
      "Ġwhen": 158,
      "llows": 159,
      "ark": 160,
      "Ġdark": 161,
      "owers": 162,
      "Ġcov": 163,
      "Ġneeds": 164,
      "Ġbrings": 165,
      "Ġafternoon": 166,
      "Ġfollows": 167,
      "Ġbefore": 168,
      "Ġmean": 169,
      "ed": 170,
      "howers": 171,
      "ir": 172,
      "it": 173,
      "ol": 174,
      "os": 175,
      "pp": 176,
      "rn": 177,
      "ts": 178,
      "urn": 179,
      "Ġshowers": 180,
      "Ġair": 181,
      "Ġform": 182,
      "Ġby": 183,
      "ont": 184,
      "Ġstr": 185,
      "Ġmak": 186,
      "Ġcool": 187,
      "Ġsuns": 188,
      "Ġstorms": 189,
      "Ġskies": 190,
      "Ġfrom": 191,
      "Ġfront": 192,
      "rough": 193,
      "Ġdry": 194,
      "ang": 195,
      "ast": 196,
      "Ġthrough": 197,
      "Ġfalls": 198,
      "Ġlightning": 199,
      "ent": 200,
      "Ġcovers": 201,
      "ack": 202,
      "cast": 203,
      "dy": 204,
      "ening": 205,
      "ft": 206,
      "iv": 207,
      "iz": 208,
      "ill": 209,
      "ick": 210,
      "les": 211,
      "ny": 212,
      "oa": 213,
      "ov": 214,
      "ock": 215,
      "ps": 216,
      "ry": 217,
      "row": 218,
      "th": 219,
      "ud": 220,
      "up": 221,
      "you": 222,
      "ze": 223,
      "Ġk": 224,
      "Ġit": 225,
      "Ġup": 226,
      "Ġyou": 227,
      "hes": 228,
      "Ġton": 229,
      "Ġtre": 230,
      "Ġtom": 231,
      "Ġsp": 232,
      "Ġset": 233,
      "Ġcar": 234,
      "Ġan": 235,
      "Ġall": 236,
      "Ġare": 237,
      "Ġapp": 238,
      "Ġwee": 239,
      "Ġwill": 240,
      "orrow": 241,
      "Ġris": 242,
      "Ġroo": 243,
      "Ġfl": 244,
      "Ġfor": 245,
      "Ġfore": 246,
      "Ġbl": 247,
      "art": 248,
      "Ġdow": 249,
      "Ġcloudy": 250,
      "Ġbree": 251,
      "Ġnight": 252,
      "Ġsunny": 253,
      "Ġgather": 254,
      "Ġgent": 255
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "č",
        "Ċ"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "in",
        "g"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "e",
        "r"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "a",
        "in"
      ],
      [
        "Ġr",
        "ain"
      ],
      [
        "d",
        "s"
      ],
      [
        "Ġc",
        "l"
      ],
      [
        "l",
        "l"
      ],
      [
        "a",
        "r"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "o",
        "w"
      ],
      [
        "o",
        "n"
      ],
      [
        "e",
        "s"
      ],
      [
        "Ġs",
        "t"
      ],
      [
        "Ġcl",
        "ou"
      ],
      [
        "g",
        "h"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "or",
        "m"
      ],
      [
        "Ġb",
        "r"
      ],
      [
        "Ġclou",
        "ds"
      ],
      [
        "u",
        "n"
      ],
      [
        "Ġc",
        "o"
      ],
      [
        "i",
        "gh"
      ],
      [
        "t",
        "er"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġs",
        "un"
      ],
      [
        "Ġst",
        "orm"
      ],
      [
        "a",
        "y"
      ],
      [
        "e",
        "e"
      ],
      [
        "i",
        "s"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "Ġw",
        "in"
      ],
      [
        "Ġbr",
        "ing"
      ],
      [
        "igh",
        "t"
      ],
      [
        "a",
        "v"
      ],
      [
        "n",
        "ing"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġ",
        "he"
      ],
      [
        "Ġs",
        "k"
      ],
      [
        "av",
        "y"
      ],
      [
        "Ġhe",
        "avy"
      ],
      [
        "f",
        "ter"
      ],
      [
        "Ġa",
        "fter"
      ],
      [
        "Ġwin",
        "d"
      ],
      [
        "a",
        "t"
      ],
      [
        "a",
        "ll"
      ],
      [
        "e",
        "t"
      ],
      [
        "n",
        "d"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġf",
        "r"
      ],
      [
        "r",
        "ou"
      ],
      [
        "u",
        "m"
      ],
      [
        "er",
        "s"
      ],
      [
        "Ġd",
        "r"
      ],
      [
        "Ġsk",
        "y"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "ar"
      ],
      [
        "Ġ",
        "on"
      ],
      [
        "a",
        "k"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "o",
        "m"
      ],
      [
        "o",
        "on"
      ],
      [
        "he",
        "r"
      ],
      [
        "Ġt",
        "h"
      ],
      [
        "or",
        "e"
      ],
      [
        "or",
        "ning"
      ],
      [
        "Ġf",
        "o"
      ],
      [
        "Ġcl",
        "ear"
      ],
      [
        "Ġm",
        "orning"
      ],
      [
        "at",
        "her"
      ],
      [
        "b",
        "re"
      ],
      [
        "l",
        "d"
      ],
      [
        "o",
        "o"
      ],
      [
        "o",
        "p"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "Ġ",
        "um"
      ],
      [
        "Ġw",
        "ar"
      ],
      [
        "Ġf",
        "all"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        "ll",
        "a"
      ],
      [
        "Ġd",
        "ay"
      ],
      [
        "ow",
        "s"
      ],
      [
        "Ġm",
        "e"
      ],
      [
        "Ġco",
        "ld"
      ],
      [
        "Ġn",
        "o"
      ],
      [
        "ee",
        "ds"
      ],
      [
        "Ġg",
        "rou"
      ],
      [
        "Ġl",
        "ight"
      ],
      [
        "bre",
        "lla"
      ],
      [
        "Ġum",
        "brella"
      ],
      [
        "Ġwar",
        "m"
      ],
      [
        "Ġgrou",
        "nd"
      ],
      [
        "d",
        "ay"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "v"
      ],
      [
        "e",
        "ather"
      ],
      [
        "f",
        "ore"
      ],
      [
        "h",
        "in"
      ],
      [
        "i",
        "es"
      ],
      [
        "l",
        "e"
      ],
      [
        "n",
        "ow"
      ],
      [
        "n",
        "oon"
      ],
      [
        "o",
        "day"
      ],
      [
        "Ġ",
        "ev"
      ],
      [
        "he",
        "n"
      ],
      [
        "Ġt",
        "oday"
      ],
      [
        "Ġs",
        "now"
      ],
      [
        "Ġa",
        "nd"
      ],
      [
        "Ġw",
        "et"
      ],
      [
        "Ġw",
        "eather"
      ],
      [
        "Ġw",
        "hen"
      ],
      [
        "ll",
        "ows"
      ],
      [
        "ar",
        "k"
      ],
      [
        "Ġd",
        "ark"
      ],
      [
        "ow",
        "ers"
      ],
      [
        "Ġco",
        "v"
      ],
      [
        "Ġn",
        "eeds"
      ],
      [
        "Ġbring",
        "s"
      ],
      [
        "Ġafter",
        "noon"
      ],
      [
        "Ġfo",
        "llows"
      ],
      [
        "Ġbe",
        "fore"
      ],
      [
        "Ġme",
        "an"
      ],
      [
        "e",
        "d"
      ],
      [
        "h",
        "owers"
      ],
      [
        "i",
        "r"
      ],
      [
        "i",
        "t"
      ],
      [
        "o",
        "l"
      ],
      [
        "o",
        "s"
      ],
      [
        "p",
        "p"
      ],
      [
        "r",
        "n"
      ],
      [
        "t",
        "s"
      ],
      [
        "u",
        "rn"
      ],
      [
        "Ġs",
        "howers"
      ],
      [
        "Ġa",
        "ir"
      ],
      [
        "Ġf",
        "orm"
      ],
      [
        "Ġb",
        "y"
      ],
      [
        "on",
        "t"
      ],
      [
        "Ġst",
        "r"
      ],
      [
        "Ġm",
        "ak"
      ],
      [
        "Ġco",
        "ol"
      ],
      [
        "Ġsun",
        "s"
      ],
      [
        "Ġstorm",
        "s"
      ],
      [
        "Ġsk",
        "ies"
      ],
      [
        "Ġfr",
        "om"
      ],
      [
        "Ġfr",
        "ont"
      ],
      [
        "rou",
        "gh"
      ],
      [
        "Ġdr",
        "y"
      ],
      [
        "an",
        "g"
      ],
      [
        "as",
        "t"
      ],
      [
        "Ġth",
        "rough"
      ],
      [
        "Ġfall",
        "s"
      ],
      [
        "Ġlight",
        "ning"
      ],
      [
        "en",
        "t"
      ],
      [
        "Ġcov",
        "ers"
      ],
      [
        "a",
        "ck"
      ],
      [
        "c",
        "ast"
      ],
      [
        "d",
        "y"
      ],
      [
        "e",
        "ning"
      ],
      [
        "f",
        "t"
      ],
      [
        "i",
        "v"
      ],
      [
        "i",
        "z"
      ],
      [
        "i",
        "ll"
      ],
      [
        "i",
        "ck"
      ],
      [
        "l",
        "es"
      ],
      [
        "n",
        "y"
      ],
      [
        "o",
        "a"
      ],
      [
        "o",
        "v"
      ],
      [
        "o",
        "ck"
      ],
      [
        "p",
        "s"
      ],
      [
        "r",
        "y"
      ],
      [
        "r",
        "ow"
      ],
      [
        "t",
        "h"
      ],
      [
        "u",
        "d"
      ],
      [
        "u",
        "p"
      ],
      [
        "y",
        "ou"
      ],
      [
        "z",
        "e"
      ],
      [
        "Ġ",
        "k"
      ],
      [
        "Ġ",
        "it"
      ],
      [
        "Ġ",
        "up"
      ],
      [
        "Ġ",
        "you"
      ],
      [
        "he",
        "s"
      ],
      [
        "Ġt",
        "on"
      ],
      [
        "Ġt",
        "re"
      ],
      [
        "Ġt",
        "om"
      ],
      [
        "Ġs",
        "p"
      ],
      [
        "Ġs",
        "et"
      ],
      [
        "Ġc",
        "ar"
      ],
      [
        "Ġa",
        "n"
      ],
      [
        "Ġa",
        "ll"
      ],
      [
        "Ġa",
        "re"
      ],
      [
        "Ġa",
        "pp"
      ],
      [
        "Ġw",
        "ee"
      ],
      [
        "Ġw",
        "ill"
      ],
      [
        "or",
        "row"
      ],
      [
        "Ġr",
        "is"
      ],
      [
        "Ġr",
        "oo"
      ],
      [
        "Ġf",
        "l"
      ],
      [
        "Ġf",
        "or"
      ],
      [
        "Ġf",
        "ore"
      ],
      [
        "Ġb",
        "l"
      ],
      [
        "ar",
        "t"
      ],
      [
        "Ġd",
        "ow"
      ],
      [
        "Ġclou",
        "dy"
      ],
      [
        "Ġbr",
        "ee"
      ],
      [
        "Ġn",
        "ight"
      ],
      [
        "Ġsun",
        "ny"
      ],
      [
        "Ġg",
        "ather"
      ],
      [
        "Ġg",
        "ent"
      ]
    ]
  }
}