{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "a": 4,
      "b": 5,
      "c": 6,
      "d": 7,
      "e": 8,
      "f": 9,
      "g": 10,
      "h": 11,
      "i": 12,
      "j": 13,
      "k": 14,
      "l": 15,
      "m": 16,
      "n": 17,
      "o": 18,
      "p": 19,
      "r": 20,
      "s": 21,
      "t": 22,
      "u": 23,
      "v": 24,
      "w": 25,
      "y": 26,
      "z": 27,
      "Ċ": 28,
      "Ġ": 29,
      "he": 30,
      "Ġt": 31,
      "in": 32,
      "Ġthe": 33,
      "Ġs": 34,
      "Ġc": 35,
      "Ġa": 36,
      "Ġw": 37,
      "or": 38,
      "Ġr": 39,
      "ing": 40,
      "ou": 41,
      "Ġf": 42,
      "er": 43,
      "Ġb": 44,
      "ain": 45,
      "Ġrain": 46,
      "ds": 47,
      "Ġcl": 48,
      "ll": 49,
      "ar": 50,
      "Ġd": 51,
      "ow": 52,
      "on": 53,
      "es": 54,
      "Ġst": 55,
      "Ġclou": 56,
      "gh": 57,
      "Ġm": 58,
      "orm": 59,
      "Ġbr": 60,
      "Ġclouds": 61,
      "un": 62,
      "Ġco": 63,
      "igh": 64,
      "ter": 65,
      "Ġn": 66,
      "Ġsun": 67,
      "Ġstorm": 68,
      "ay": 69,
      "ee": 70,
      "is": 71,
      "Ġg": 72,
      "Ġwin": 73,
      "Ġbring": 74,
      "ight": 75,
      "av": 76,
      "ning": 77,
      "re": 78,
      "Ġhe": 79,
      "Ġsk": 80,
      "avy": 81,
      "Ġheavy": 82,
      "fter": 83,
      "Ġafter": 84,
      "Ġwind": 85,
      "at": 86,
      "all": 87,
      "et": 88,
      "nd": 89,
      "Ġl": 90,
      "Ġis": 91,
      "Ġfr": 92,
      "rou": 93,
      "um": 94,
      "ers": 95,
      "Ġdr": 96,
      "Ġsky": 97,
      "an": 98,
      "ear": 99,
      "Ġon": 100,
      "ak": 101,
      "as": 102,
      "ck": 103,
      "om": 104,
      "oon": 105,
      "her": 106,
      "Ġth": 107,
      "ore": 108,
      "orning": 109,
      "Ġfo": 110,
      "Ġclear": 111,
      "Ġmorning": 112,
      "ather": 113,
      "bre": 114,
      "ld": 115,
      "oo": 116,
      "op": 117,
      "Ġh": 118,
      "Ġp": 119,
      "Ġin": 120,
      "Ġum": 121,
      "Ġwar": 122,
      "Ġfall": 123,
      "Ġbe": 124,
      "lla": 125,
      "Ġday": 126,
      "ows": 127,
      "Ġme": 128,
      "Ġcold": 129,
      "Ġno": 130,
      "eeds": 131,
      "Ġgrou": 132,
      "Ġlight": 133,
      "brella": 134,
      "Ġumbrella": 135,
      "Ġwarm": 136,
      "Ġground": 137,
      "day": 138,
      "en": 139,
      "ev": 140,
      "eather": 141,
      "fore": 142,
      "hin": 143,
      "ies": 144,
      "le": 145,
      "now": 146,
      "noon": 147,
      "oday": 148,
      "Ġev": 149,
      "hen": 150,
      "Ġtoday": 151,
      "Ġsnow": 152,
      "Ġand": 153,
      "Ġwet": 154,
      "Ġweather": 155,
      "Ġwhen": 156,
      "llows": 157,
      "ark": 158,
      "Ġdark": 159,
      "owers": 160,
      "Ġcov": 161,
      "Ġneeds": 162,
      "Ġbrings": 163,
      "Ġafternoon": 164,
      "Ġfollows": 165,
      "Ġbefore": 166,
      "Ġmean": 167,
      "ed": 168,
      "howers": 169,
      "ir": 170,
      "it": 171,
      "ol": 172,
      "os": 173,
      "pp": 174,
      "rn": 175,
      "ts": 176,
      "urn": 177,
      "Ġshowers": 178,
      "Ġair": 179,
      "Ġform": 180,
      "Ġby": 181,
      "ont": 182,
      "Ġstr": 183,
      "Ġmak": 184,
      "Ġcool": 185,
      "Ġsuns": 186,
      "Ġstorms": 187,
      "Ġskies": 188,
      "Ġfrom": 189,
      "Ġfront": 190,
      "rough": 191,
      "Ġdry": 192,
      "ang": 193,
      "ast": 194,
      "Ġthrough": 195,
      "Ġfalls": 196,
      "Ġlightning": 197,
      "ent": 198,
      "Ġcovers": 199,
      "ack": 200,
      "cast": 201,
      "dy": 202,
      "ening": 203,
      "ft": 204,
      "iv": 205,
      "iz": 206,
      "ill": 207,
      "ick": 208,
      "les": 209,
      "ny": 210,
      "oa": 211,
      "ov": 212,
      "ock": 213,
      "ps": 214,
      "ry": 215,
      "row": 216,
      "th": 217,
      "ud": 218,
      "up": 219,
      "you": 220,
      "ze": 221,
      "Ġk": 222,
      "Ġit": 223,
      "Ġup": 224,
      "Ġyou": 225,
      "hes": 226,
      "Ġton": 227,
      "Ġtre": 228,
      "Ġtom": 229,
      "Ġsp": 230,
      "Ġset": 231,
      "Ġcar": 232,
      "Ġan": 233,
      "Ġall": 234,
      "Ġare": 235,
      "Ġapp": 236,
      "Ġwee": 237,
      "Ġwill": 238,
      "orrow": 239,
      "Ġris": 240,
      "Ġroo": 241,
      "Ġfl": 242,
      "Ġfor": 243,
      "Ġfore": 244,
      "Ġbl": 245,
      "art": 246,
      "Ġdow": 247,
      "Ġcloudy": 248,
      "Ġbree": 249,
      "Ġnight": 250,
      "Ġsunny": 251,
      "Ġgather": 252,
      "Ġgent": 253,
      "Ġfros": 254,
      "aks": 255
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "in",
        "g"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "e",
        "r"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "a",
        "in"
      ],
      [
        "Ġr",
        "ain"
      ],
      [
        "d",
        "s"
      ],
      [
        "Ġc",
        "l"
      ],
      [
        "l",
        "l"
      ],
      [
        "a",
        "r"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "o",
        "w"
      ],
      [
        "o",
        "n"
      ],
      [
        "e",
        "s"
      ],
      [
        "Ġs",
        "t"
      ],
      [
        "Ġcl",
        "ou"
      ],
      [
        "g",
        "h"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "or",
        "m"
      ],
      [
        "Ġb",
        "r"
      ],
      [
        "Ġclou",
        "ds"
      ],
      [
        "u",
        "n"
      ],
      [
        "Ġc",
        "o"
      ],
      [
        "i",
        "gh"
      ],
      [
        "t",
        "er"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġs",
        "un"
      ],
      [
        "Ġst",
        "orm"
      ],
      [
        "a",
        "y"
      ],
      [
        "e",
        "e"
      ],
      [
        "i",
        "s"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "Ġw",
        "in"
      ],
      [
        "Ġbr",
        "ing"
      ],
      [
        "igh",
        "t"
      ],
      [
        "a",
        "v"
      ],
      [
        "n",
        "ing"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġ",
        "he"
      ],
      [
        "Ġs",
        "k"
      ],
      [
        "av",
        "y"
      ],
      [
        "Ġhe",
        "avy"
      ],
      [
        "f",
        "ter"
      ],
      [
        "Ġa",
        "fter"
      ],
      [
        "Ġwin",
        "d"
      ],
      [
        "a",
        "t"
      ],
      [
        "a",
        "ll"
      ],
      [
        "e",
        "t"
      ],
      [
        "n",
        "d"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġf",
        "r"
      ],
      [
        "r",
        "ou"
      ],
      [
        "u",
        "m"
      ],
      [
        "er",
        "s"
      ],
      [
        "Ġd",
        "r"
      ],
      [
        "Ġsk",
        "y"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "ar"
      ],
      [
        "Ġ",
        "on"
      ],
      [
        "a",
        "k"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "o",
        "m"
      ],
      [
        "o",
        "on"
      ],
      [
        "he",
        "r"
      ],
      [
        "Ġt",
        "h"
      ],
      [
        "or",
        "e"
      ],
      [
        "or",
        "ning"
      ],
      [
        "Ġf",
        "o"
      ],
      [
        "Ġcl",
        "ear"
      ],
      [
        "Ġm",
        "orning"
      ],
      [
        "at",
        "her"
      ],
      [
        "b",
        "re"
      ],
      [
        "l",
        "d"
      ],
      [
        "o",
        "o"
      ],
      [
        "o",
        "p"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "Ġ",
        "um"
      ],
      [
        "Ġw",
        "ar"
      ],
      [
        "Ġf",
        "all"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        "ll",
        "a"
      ],
      [
        "Ġd",
        "ay"
      ],
      [
        "ow",
        "s"
      ],
      [
        "Ġm",
        "e"
      ],
      [
        "Ġco",
        "ld"
      ],
      [
        "Ġn",
        "o"
      ],
      [
        "ee",
        "ds"
      ],
      [
        "Ġg",
        "rou"
      ],
      [
        "Ġl",
        "ight"
      ],
      [
        "bre",
        "lla"
      ],
      [
        "Ġum",
        "brella"
      ],
      [
        "Ġwar",
        "m"
      ],
      [
        "Ġgrou",
        "nd"
      ],
      [
        "d",
        "ay"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "v"
      ],
      [
        "e",
        "ather"
      ],
      [
        "f",
        "ore"
      ],
      [
        "h",
        "in"
      ],
      [
        "i",
        "es"
      ],
      [
        "l",
        "e"
      ],
      [
        "n",
        "ow"
      ],
      [
        "n",
        "oon"
      ],
      [
        "o",
        "day"
      ],
      [
        "Ġ",
        "ev"
      ],
      [
        "he",
        "n"
      ],
      [
        "Ġt",
        "oday"
      ],
      [
        "Ġs",
        "now"
      ],
      [
        "Ġa",
        "nd"
      ],
      [
        "Ġw",
        "et"
      ],
      [
        "Ġw",
        "eather"
      ],
      [
        "Ġw",
        "hen"
      ],
      [
        "ll",
        "ows"
      ],
      [
        "ar",
        "k"
      ],
      [
        "Ġd",
        "ark"
      ],
      [
        "ow",
        "ers"
      ],
      [
        "Ġco",
        "v"
      ],
      [
        "Ġn",
        "eeds"
      ],
      [
        "Ġbring",
        "s"
      ],
      [
        "Ġafter",
        "noon"
      ],
      [
        "Ġfo",
        "llows"
      ],
      [
        "Ġbe",
        "fore"
      ],
      [
        "Ġme",
        "an"
      ],
      [
        "e",
        "d"
      ],
      [
        "h",
        "owers"
      ],
      [
        "i",
        "r"
      ],
      [
        "i",
        "t"
      ],
      [
        "o",
        "l"
      ],
      [
        "o",
        "s"
      ],
      [
        "p",
        "p"
      ],
      [
        "r",
        "n"
      ],
      [
        "t",
        "s"
      ],
      [
        "u",
        "rn"
      ],
      [
        "Ġs",
        "howers"
      ],
      [
        "Ġa",
        "ir"
      ],
      [
        "Ġf",
        "orm"
      ],
      [
        "Ġb",
        "y"
      ],
      [
        "on",
        "t"
      ],
      [
        "Ġst",
        "r"
      ],
      [
        "Ġm",
        "ak"
      ],
      [
        "Ġco",
        "ol"
      ],
      [
        "Ġsun",
        "s"
      ],
      [
        "Ġstorm",
        "s"
      ],
      [
        "Ġsk",
        "ies"
      ],
      [
        "Ġfr",
        "om"
      ],
      [
        "Ġfr",
        "ont"
      ],
      [
        "rou",
        "gh"
      ],
      [
        "Ġdr",
        "y"
      ],
      [
        "an",
        "g"
      ],
      [
        "as",
        "t"
      ],
      [
        "Ġth",
        "rough"
      ],
      [
        "Ġfall",
        "s"
      ],
      [
        "Ġlight",
        "ning"
      ],
      [
        "en",
        "t"
      ],
      [
        "Ġcov",
        "ers"
      ],
      [
        "a",
        "ck"
      ],
      [
        "c",
        "ast"
      ],
      [
        "d",
        "y"
      ],
      [
        "e",
        "ning"
      ],
      [
        "f",
        "t"
      ],
      [
        "i",
        "v"
      ],
      [
        "i",
        "z"
      ],
      [
        "i",
        "ll"
      ],
      [
        "i",
        "ck"
      ],
      [
        "l",
        "es"
      ],
      [
        "n",
        "y"
      ],
      [
        "o",
        "a"
      ],
      [
        "o",
        "v"
      ],
      [
        "o",
        "ck"
      ],
      [
        "p",
        "s"
      ],
      [
        "r",
        "y"
      ],
      [
        "r",
        "ow"
      ],
      [
        "t",
        "h"
      ],
      [
        "u",
        "d"
      ],
      [
        "u",
        "p"
      ],
      [
        "y",
        "ou"
      ],
      [
        "z",
        "e"
      ],
      [
        "Ġ",
        "k"
      ],
      [
        "Ġ",
        "it"
      ],
      [
        "Ġ",
        "up"
      ],
      [
        "Ġ",
        "you"
      ],
      [
        "he",
        "s"
      ],
      [
        "Ġt",
        "on"
      ],
      [
        "Ġt",
        "re"
      ],
      [
        "Ġt",
        "om"
      ],
      [
        "Ġs",
        "p"
      ],
      [
        "Ġs",
        "et"
      ],
      [
        "Ġc",
        "ar"
      ],
      [
        "Ġa",
        "n"
      ],
      [
        "Ġa",
        "ll"
      ],
      [
        "Ġa",
        "re"
      ],
      [
        "Ġa",
        "pp"
      ],
      [
        "Ġw",
        "ee"
      ],
      [
        "Ġw",
        "ill"
      ],
      [
        "or",
        "row"
      ],
      [
        "Ġr",
        "is"
      ],
      [
        "Ġr",
        "oo"
      ],
      [
        "Ġf",
        "l"
      ],
      [
        "Ġf",
        "or"
      ],
      [
        "Ġf",
        "ore"
      ],
      [
        "Ġb",
        "l"
      ],
      [
        "ar",
        "t"
      ],
      [
        "Ġd",
        "ow"
      ],
      [
        "Ġclou",
        "dy"
      ],
      [
        "Ġbr",
        "ee"
      ],
      [
        "Ġn",
        "ight"
      ],
      [
        "Ġsun",
        "ny"
      ],
      [
        "Ġg",
        "ather"
      ],
      [
        "Ġg",
        "ent"
      ],
      [
        "Ġfr",
        "os"
      ],
      [
        "ak",
        "s"
      ]
    ]
  }
}